app/controllers/polls_controller.rb

SELECT "votes".* FROM "votes"
---
  def show
    @votes = Vote.all

INSERT INTO "polls" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Do you own a laptop?"], ["created_at", "2023-01-07 09:32:29.570658"], ["updated_at", "2023-01-07 09:32:29.570658"]]
---
  def create
    @poll = Poll.new(poll_params)

    respond_to do |format|
      if @poll.save