app/controllers/votes_controller.rb

INSERT INTO "votes" ("name", "answer", "poll_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Julian"], ["answer", "Yes"], ["poll_id", 1], ["created_at", "2023-01-07 09:32:39.309237"], ["updated_at", "2023-01-07 09:32:39.309237"]]
---
  def create
    @vote = Vote.new(vote_params)

    respond_to do |format|
      if @vote.save